package kr.megaptera.makaogift.backdoor;

import org.springframework.jdbc.core.JdbcTemplate;
import org.springframework.transaction.annotation.Transactional;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RestController;

@RestController
@RequestMapping("/backdoor")
@Transactional
public class BackdoorController {
    private JdbcTemplate jdbcTemplate;

    public BackdoorController(JdbcTemplate jdbcTemplate) {
        this.jdbcTemplate = jdbcTemplate;
    }

    @GetMapping("/setup-database")
    public String setupDatabase() {
        jdbcTemplate.execute("DELETE FROM product");

        jdbcTemplate.update("INSERT INTO product(" +
                        "id, title, maker, price, description, image_url)" +
                        " VALUES(1,'치즈닭갈비 170g(1개)','아워홈','3320','치즈닭갈비 170g(1개)','https://img.danawa.com/prod_img/500000/086/042/img/15042086_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (2,'청정원 호밍스 춘천식 치즈닭갈비 220g(1개)','대상','5580','청정원 호밍스 춘천식 치즈닭갈비 220g(1개)','https://img.danawa.com/prod_img/500000/983/344/img/16344983_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (3,'춘천식 닭갈비 350g(1개)','아워홈','4120','춘천식 닭갈비 350g(1개)','https://img.danawa.com/prod_img/500000/914/473/img/13473914_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (4,'안주이닭 치즈불닭 210g(1개)','하림','5890','안주이닭 치즈불닭 210g(1개)','https://img.danawa.com/prod_img/500000/425/077/img/16077425_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (5,'동물복지 수비드 닭가슴살 오리지널 130g(1개)','참프레','1980','동물복지 수비드 닭가슴살 오리지널 130g(1개)','https://img.danawa.com/prod_img/500000/428/750/img/15750428_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (6,'똑똑한식단 리얼탄두리맛 안심 닭가슴살 100g(1개)','헬스앤뷰티','2950','똑똑한식단 리얼탄두리맛 안심 닭가슴살 100g(1개)','https://img.danawa.com/prod_img/500000/567/155/img/13155567_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (7,'본죽 더 부드러운 닭가슴살 장조림 130g(1개)','본아이에프','3960','본죽 더 부드러운 닭가슴살 장조림 130g(1개)','https://img.danawa.com/prod_img/500000/077/303/img/18303077_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (8,'잇츠나우 한입 닭가슴살 오리지널 100g(1개)','푸드나무','2770','잇츠나우 한입 닭가슴살 오리지널 100g(1개)','https://img.danawa.com/prod_img/500000/403/337/img/18337403_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (9,'햇살닭 떡갈비맛 닭가슴살 함박스테이크 100g(1개)','햇살푸드시스템','1850','햇살닭 떡갈비맛 닭가슴살 함박스테이크 100g(1개)','https://img.danawa.com/prod_img/500000/040/781/img/15781040_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (10,'매콤한 칠리 닭가슴살 110g(1개)','아워홈','1900','매콤한 칠리 닭가슴살 110g(1개)','https://img.danawa.com/prod_img/500000/050/063/img/15063050_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (11,'바로드숑 닭가슴살 비엔나 소시지 오리지널 100g(1개)','아침','2270','바로드숑 닭가슴살 비엔나 소시지 오리지널 100g(1개)','https://img.danawa.com/prod_img/500000/745/667/img/15667745_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (12,'마이닭 닭가슴살 더블 함박스테이크 매콤치즈 100g(1개)','미트리','1800','마이닭 닭가슴살 더블 함박스테이크 매콤치즈 100g(1개)','https://img.danawa.com/prod_img/500000/467/843/img/15843467_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (13,'심야식당 뼈없는 불닭발 160g(1개)','동원F&B','4550','심야식당 뼈없는 불닭발 160g(1개)','https://img.danawa.com/prod_img/500000/300/588/img/5588300_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (14,'청정원 안주야 논현동 포차스타일 직화무뼈닭발 160g(1개)','대상','6590','청정원 안주야 논현동 포차스타일 직화무뼈닭발 160g(1개)','https://img.danawa.com/prod_img/500000/089/945/img/5945089_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (15,'한끼애 직화불닭발 150g(3개)','한성기업','14500','한끼애 직화불닭발 150g(3개)','https://img.danawa.com/prod_img/500000/245/610/img/11610245_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (16,'청정원 안주야 논현동 포차스타일 직화무뼈닭발 160g(2개)','대상','15210','청정원 안주야 논현동 포차스타일 직화무뼈닭발 160g(2개)','https://img.danawa.com/prod_img/500000/237/291/img/9291237_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (17,'직화 오돌뼈 150g(3개)','S레이디','12290','직화 오돌뼈 150g(3개)','https://img.danawa.com/prod_img/500000/377/042/img/15042377_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (18,'서울식 야시장맛 매콤오돌뼈 160g(1개)','아워홈','3970','서울식 야시장맛 매콤오돌뼈 160g(1개)','https://img.danawa.com/prod_img/500000/604/668/img/8668604_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (19,'심야식당 매콤오돌뼈 160g(1개)','동원F&B','4570','심야식당 매콤오돌뼈 160g(1개)','https://img.danawa.com/prod_img/500000/537/588/img/5588537_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (20,'치즈오돌뼈 150g(1개)','아워홈','3900','치즈오돌뼈 150g(1개)','https://img.danawa.com/prod_img/500000/846/041/img/15041846_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (21,'양념오돌뼈볶음 400g(2개)','임꺽정푸드시스템','14250','양념오돌뼈볶음 400g(2개)','https://img.danawa.com/prod_img/500000/257/380/img/16380257_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (22,'청정원 안주야 통마늘 제육오돌뼈 160g(1개)','대상','4780','청정원 안주야 통마늘 제육오돌뼈 160g(1개)','https://img.danawa.com/prod_img/500000/070/760/img/15760070_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (23,'양념오돌뼈볶음 400g(1개)','임꺽정푸드시스템','7540','양념오돌뼈볶음 400g(1개)','https://img.danawa.com/prod_img/500000/233/380/img/16380233_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (24,'쉐프원 안주야 매콤오돌뼈볶음 280g(1개)','대상','4500','쉐프원 안주야 매콤오돌뼈볶음 280g(1개)','https://img.danawa.com/prod_img/500000/533/286/img/9286533_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (25,'청정원 안주야 소양돼지곱창 160g(1개)','대상','4780','청정원 안주야 소양돼지곱창 160g(1개)','https://img.danawa.com/prod_img/500000/933/070/img/16070933_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (26,'청정원 안주야 논현동 포차스타일 직화모듬곱창 260g(1개)','대상','6470','청정원 안주야 논현동 포차스타일 직화모듬곱창 260g(1개)','https://img.danawa.com/prod_img/500000/894/944/img/5944894_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (27,'주당맛집 소곱창 180g(2개)','진지','28500','주당맛집 소곱창 180g(2개)','https://img.danawa.com/prod_img/500000/169/133/img/18133169_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (28,'직화 양념 돼지곱창 250g(1개)','족발야시장','6890','직화 양념 돼지곱창 250g(1개)','https://img.danawa.com/prod_img/500000/706/325/img/18325706_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (29,'심야식당 불막창 160g(1개)','동원F&B','3910','심야식당 불막창 160g(1개)','https://img.danawa.com/prod_img/500000/493/588/img/5588493_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (30,'청정원 안주야 논현동 포차스타일 불막창 160g(1개)','대상','7720','청정원 안주야 논현동 포차스타일 불막창 160g(1개)','https://img.danawa.com/prod_img/500000/541/188/img/5188541_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (31,'심야식당 훈제막창 600g(1개)','동원F&B','17290','심야식당 훈제막창 600g(1개)','https://img.danawa.com/prod_img/500000/105/207/img/9207105_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (32,'청정원 안주야 오븐에 초벌한 돈막창 260g(2개)','대상','14440','청정원 안주야 오븐에 초벌한 돈막창 260g(2개)','https://img.danawa.com/prod_img/500000/473/048/img/15048473_1.jpg??shrink=360:360&_v=20221130203949'),\n" +
                "  (33,'30년전통 여수 백용준님의 간장 꽃게장 2.3kg(1개)','전라도백서방김치','15880','30년전통 여수 백용준님의 간장 꽃게장 2.3kg(1개)','https://img.danawa.com/prod_img/500000/586/381/img/13381586_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (34,'돌게장 간장게장 2.5kg(1개)','여수사나이','32100','돌게장 간장게장 2.5kg(1개)','https://img.danawa.com/prod_img/500000/999/812/img/12812999_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (35,'간장게장 모든장 2.3kg(1개)','모든반찬','30600','간장게장 모든장 2.3kg(1개)','https://img.danawa.com/prod_img/500000/512/356/img/13356512_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (36,'간장삼점 꽃게장 2.3kg(1개)','전라도백서방김치','19750','간장삼점 꽃게장 2.3kg(1개)','https://img.danawa.com/prod_img/500000/271/839/img/14839271_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (37,'여수사나이 꽃게장 2개(미)이상 1.1kg(1개)','21세기푸드','30300','여수사나이 꽃게장 2개(미)이상 1.1kg(1개)','https://img.danawa.com/prod_img/500000/422/992/img/13992422_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (38,'간장 전통 꽃게장 2.4kg(1개)','조선대가','49300','간장 전통 꽃게장 2.4kg(1개)','https://img.danawa.com/prod_img/500000/943/494/img/4494943_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (39,'김명월꽃게장 간장게장 3.8kg(1개)','청정태안식품','109610','김명월꽃게장 간장게장 3.8kg(1개)','https://img.danawa.com/prod_img/500000/116/231/img/2231116_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (40,'간장게장 1kg(1개)','바른씨','16110','간장게장 1kg(1개)','https://img.danawa.com/prod_img/500000/730/733/img/12733730_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (41,'매콤 양념게장 1kg(1개)','윤택한식탁','25780','매콤 양념게장 1kg(1개)','https://img.danawa.com/prod_img/500000/330/213/img/17213330_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (42,'양념 꽃게장 1kg(1개)','양님이식품','23830','양념 꽃게장 1kg(1개)','https://img.danawa.com/prod_img/500000/520/476/img/4476520_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (43,'양념게장 1kg(1개)','바른씨','12150','양념게장 1kg(1개)','https://img.danawa.com/prod_img/500000/805/733/img/12733805_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (44,'양념게장 1kg(1개)','수미푸드','20790','양념게장 1kg(1개)','https://img.danawa.com/prod_img/500000/594/944/img/12944594_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (45,'깐새우장 30개(마리)내외 1kg(1개)','간장','18890','깐새우장 30개(마리)내외 1kg(1개)','https://img.danawa.com/prod_img/500000/012/502/img/13502012_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (46,'팽현숙의 맛있는 간장새우장 500g(2개)','승화푸드','26250','팽현숙의 맛있는 간장새우장 500g(2개)','https://img.danawa.com/prod_img/500000/853/291/img/13291853_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (47,'간장 깐새우장 500g(2개)','전라도백서방김치','14870','간장 깐새우장 500g(2개)','https://img.danawa.com/prod_img/500000/348/837/img/14837348_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (48,'깐양념새우장 800g(1개)','윤택한식탁','18820','깐양념새우장 800g(1개)','https://img.danawa.com/prod_img/500000/162/213/img/17213162_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (49,'양념 깐새우장 400g(2개)','전라도백서방김치','14880','양념 깐새우장 400g(2개)','https://img.danawa.com/prod_img/500000/516/837/img/14837516_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (50,'간장 새우장 400g(1개)','한춘상','23690','간장 새우장 400g(1개)','https://img.danawa.com/prod_img/500000/387/978/img/9978387_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (51,'간장 깐새우장 300g(1개)','바른씨','6740','간장 깐새우장 300g(1개)','https://img.danawa.com/prod_img/500000/544/730/img/12730544_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (52,'바다자리 간장 새우장 400g(1개)','마산푸드','13100','바다자리 간장 새우장 400g(1개)','https://img.danawa.com/prod_img/500000/000/465/img/14465000_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (53,'간장 연어장 300g(1개)','바른씨','9890','간장 연어장 300g(1개)','https://img.danawa.com/prod_img/500000/158/726/img/12726158_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (54,'짜지않은 간장 생 연어장 500g(1개)','살롱드파파','18600','짜지않은 간장 생 연어장 500g(1개)','https://img.danawa.com/prod_img/500000/410/350/img/13350410_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (55,'연어장 500g(1개)','장담그는청년들','18440','연어장 500g(1개)','https://img.danawa.com/prod_img/500000/992/783/img/12783992_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (56,'모노키친 간장 연어장 470g(1개)','엘에프푸드','16040','모노키친 간장 연어장 470g(1개)','https://img.danawa.com/prod_img/500000/213/618/img/11618213_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (57,'반숙계란장 400g(1개)','풍림푸드','3490','반숙계란장 400g(1개)','https://img.danawa.com/prod_img/500000/570/997/img/13997570_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (58,'누리웰 비벼먹는 반숙계란장 400g(1개)','조인(JOIN)','3900','누리웰 비벼먹는 반숙계란장 400g(1개)','https://img.danawa.com/prod_img/500000/729/997/img/13997729_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (59,'반숙계란장 320g(1개)','산들해','5290','반숙계란장 320g(1개)','https://img.danawa.com/prod_img/500000/019/400/img/18400019_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (60,'요리찬 밥도둑 반숙계란장 300g(2개)','풍림푸드','11640','요리찬 밥도둑 반숙계란장 300g(2개)','https://img.danawa.com/prod_img/500000/312/150/img/17150312_1.jpg??shrink=360:360&_v=20221130204100'),\n" +
                "  (61,'데르뜨 바이 매일우유 순 38% 우유 롤케이크 370g(1개)','매일유업','18800','데르뜨 바이 매일우유 순 38% 우유 롤케이크 370g(1개)','https://img.danawa.com/prod_img/500000/737/165/img/18165737_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (62,'경성명과 롤 케이크 500g+파운드 케이크 500g(1개)','한올식품','14300','경성명과 롤 케이크 500g+파운드 케이크 500g(1개)','https://img.danawa.com/prod_img/500000/967/353/img/9353967_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (63,'데르뜨 바이 매일두유 99.9 롤케이크 110g(1개)','매일유업','3900','데르뜨 바이 매일두유 99.9 롤케이크 110g(1개)','https://img.danawa.com/prod_img/500000/016/166/img/18166016_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (64,'소화가 잘되는 우유 크림 롤케이크 360g(1개)','매일유업','12450','소화가 잘되는 우유 크림 롤케이크 360g(1개)','https://img.danawa.com/prod_img/500000/479/186/img/18186479_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (65,'김밥을 꿈꾸는 블루베리 롤케익 415g(1개)','밀러가또','20670','김밥을 꿈꾸는 블루베리 롤케익 415g(1개)','https://img.danawa.com/prod_img/500000/182/505/img/17505182_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (66,'김밥을 꿈꾸는 생크림 롤케익 400g(1개)','밀러가또','20670','김밥을 꿈꾸는 생크림 롤케익 400g(1개)','https://img.danawa.com/prod_img/500000/170/505/img/17505170_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (67,'소화가 잘되는 우유 초코 크림 롤케이크 380g(1개)','매일유업','20360','소화가 잘되는 우유 초코 크림 롤케이크 380g(1개)','https://img.danawa.com/prod_img/500000/731/186/img/18186731_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (68,'김밥을 꿈꾸는 라즈베리 롤케익 415g(1개)','밀러가또','21300','김밥을 꿈꾸는 라즈베리 롤케익 415g(1개)','https://img.danawa.com/prod_img/500000/206/505/img/17505206_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (69,'유어스 힛더티 슈퍼코코말차 모찌롤 125g(1개)','GS리테일','6660','유어스 힛더티 슈퍼코코말차 모찌롤 125g(1개)','https://img.danawa.com/prod_img/500000/307/440/img/17440307_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (70,'블루베리롤 450g(1개)','신라명과','13200','블루베리롤 450g(1개)','https://img.danawa.com/prod_img/500000/980/562/img/1562980_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (71,'경성명과 롤 케이크 500g+초코파운드 480g(1개)','한올식품','13800','경성명과 롤 케이크 500g+초코파운드 480g(1개)','https://img.danawa.com/prod_img/500000/690/354/img/9354690_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (72,'제리롤 490g(1개)','신라명과','12190','제리롤 490g(1개)','https://img.danawa.com/prod_img/500000/983/562/img/1562983_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (73,'밀크앤허니 하니카스테라 380g+소프트제리롤 520g(1개)','신세계푸드','15930','밀크앤허니 하니카스테라 380g+소프트제리롤 520g(1개)','https://img.danawa.com/prod_img/500000/381/210/img/7210381_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (74,'밀크앤허니 소프트제리롤 520g+잉글리쉬파운드 650g(1개)','신세계푸드','17900','밀크앤허니 소프트제리롤 520g+잉글리쉬파운드 650g(1개)','https://img.danawa.com/prod_img/500000/612/210/img/7210612_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (75,'데르뜨 바이 매일바이오 딸기요거트 롤케이크 370g(1개)','매일유업','24500','데르뜨 바이 매일바이오 딸기요거트 롤케이크 370g(1개)','https://img.danawa.com/prod_img/500000/869/186/img/18186869_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (76,'데르뜨 바이 매일두유 검은콩 롤케이크 110g(1개)','매일유업','3900','데르뜨 바이 매일두유 검은콩 롤케이크 110g(1개)','https://img.danawa.com/prod_img/500000/854/165/img/18165854_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (77,'필라델피아 치즈케익 오레오 794g(1개)','몬델리즈','19220','필라델피아 치즈케익 오레오 794g(1개)','https://img.danawa.com/prod_img/500000/233/156/img/10156233_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (78,'필라델피아 치즈케익 플레인 1.7kg(1개)','몬델리즈','30100','필라델피아 치즈케익 플레인 1.7kg(1개)','https://img.danawa.com/prod_img/500000/256/559/img/1559256_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (79,'필라델피아 치즈케익 클래식 794g(1개)','몬델리즈','17180','필라델피아 치즈케익 클래식 794g(1개)','https://img.danawa.com/prod_img/500000/008/561/img/1561008_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (80,'상하목장 우유 레이어 케이크 550g(1개)','매일유업','26980','상하목장 우유 레이어 케이크 550g(1개)','https://img.danawa.com/prod_img/500000/043/860/img/17860043_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (81,'베키아에누보 레어 프로마쥬 케이크 380g(1개)','신세계푸드','19430','베키아에누보 레어 프로마쥬 케이크 380g(1개)','https://img.danawa.com/prod_img/500000/474/731/img/10731474_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (82,'필라델피아 치즈케익 794g 2종 플레인+오레오(1개)','몬델리즈','33040','필라델피아 치즈케익 794g 2종 플레인+오레오(1개)','https://img.danawa.com/prod_img/500000/162/013/img/13013162_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (83,'카페스노우 크래프트 크림치즈케익 370g(1개)','SPC삼립','5020','카페스노우 크래프트 크림치즈케익 370g(1개)','https://img.danawa.com/prod_img/500000/764/551/img/16551764_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (84,'노브랜드 치즈 크림 케익 590g(1개)','이마트','9970','노브랜드 치즈 크림 케익 590g(1개)','https://img.danawa.com/prod_img/500000/528/389/img/5389528_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (85,'카페스노우 쵸코 티라미스 케익 2개입 120g(1개)','SPC삼립','5780','카페스노우 쵸코 티라미스 케익 2개입 120g(1개)','https://img.danawa.com/prod_img/500000/385/719/img/14719385_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (86,'더블 프로마쥬 치즈 케이크 330g(1개)','르타오','26880','더블 프로마쥬 치즈 케이크 330g(1개)','https://img.danawa.com/prod_img/500000/262/835/img/15835262_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (87,'치즈 케이크 650g(1개)','에멘탈','27840','치즈 케이크 650g(1개)','https://img.danawa.com/prod_img/500000/386/942/img/15942386_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (88,'인절미 크림 치즈케익 580g(1개)','아워홈','17970','인절미 크림 치즈케익 580g(1개)','https://img.danawa.com/prod_img/500000/920/942/img/15942920_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (89,'케이크만들기 냉동생지 케익시트 3호 400g(1개)','서울식품공업','7020','케이크만들기 냉동생지 케익시트 3호 400g(1개)','https://img.danawa.com/prod_img/500000/321/553/img/16553321_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (90,'초코 케이크시트 2호 280g(1개)','미나미제과','5000','초코 케이크시트 2호 280g(1개)','https://img.danawa.com/prod_img/500000/922/552/img/16552922_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (91,'레드벨벳 케이크시트 2호 280g(1개)','미나미제과','6200','레드벨벳 케이크시트 2호 280g(1개)','https://img.danawa.com/prod_img/500000/964/552/img/16552964_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (92,'몽블랑제 케이크시트 2호 200g(1개)','홈플러스','8630','몽블랑제 케이크시트 2호 200g(1개)','https://img.danawa.com/prod_img/500000/819/830/img/10830819_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (93,'유어스 힛더티 슈퍼말차 티라미수 120g(1개)','GS리테일','4470','유어스 힛더티 슈퍼말차 티라미수 120g(1개)','https://img.danawa.com/prod_img/500000/268/440/img/17440268_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (94,'피코크 티라미수 케이크 680g(1개)','이마트','19970','피코크 티라미수 케이크 680g(1개)','https://img.danawa.com/prod_img/500000/087/694/img/6694087_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (95,'카페스노우 쵸코 티라미스 케익 2개입 120g(1개)','SPC삼립','5780','카페스노우 쵸코 티라미스 케익 2개입 120g(1개)','https://img.danawa.com/prod_img/500000/385/719/img/14719385_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (96,'스노우 티라미수 크림케이크 340g(1개)','신세계푸드','15240','스노우 티라미수 크림케이크 340g(1개)','https://img.danawa.com/prod_img/500000/938/683/img/13683938_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (97,'허쉬 초코퍼지 휘낭시에 8개입 400g(1개)','SPC삼립','4550','허쉬 초코퍼지 휘낭시에 8개입 400g(1개)','https://img.danawa.com/prod_img/500000/178/389/img/17389178_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (98,'크래프트 진한 크림치즈 휘낭시에 8개입 360g(1개)','SPC삼립','3660','크래프트 진한 크림치즈 휘낭시에 8개입 360g(1개)','https://img.danawa.com/prod_img/500000/943/064/img/12064943_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (99,'오븐에 구운 버터 휘낭시에 8개입 360g(1개)','SPC삼립','3120','오븐에 구운 버터 휘낭시에 8개입 360g(1개)','https://img.danawa.com/prod_img/500000/727/979/img/10979727_1.jpg??shrink=360:360&_v=20221130204220'),\n" +
                "  (100,'휘낭시에 골드 9개입 252g(1개)','신라명과','15240','휘낭시에 골드 9개입 252g(1개)','https://img.danawa.com/prod_img/500000/326/780/img/10780326_1.jpg??shrink=360:360&_v=20221130204220')\n"
        );

        return "OK!";
    }
}
